# 2次元リスト
2つのインデックスで要素を指定するリストのこと。
リストにリストを組み合わせて作成し、インデックスを2つ指定してデータを参照する。

# 2次元リストを作成してみよう
item_1 = ["木の棒", "こん棒", "エクスカリバー"]
item_2 = ["おにぎり", "おにぎり", "むぎ茶"]
item_3 = ["毒消し", "薬草", "アイアンシールド"]

# item_1 ~ 3を、basketリストに代入して、print関数で出力
basket = [item_1, item_2, item_3]
print(basket)
→
[['木の棒', 'こん棒', 'エクスカリバー'], ['おにぎり', 'おにぎり', 'むぎ茶'], ['毒消し', '薬草', 'アイアンシールド']]


# 2次元リストの中身を出力してみよう
array = [["勇者","忍者","武士"],["戦士","僧侶","魔法使い"]]
# この下で、arrayを出力してみよう
print(array[1][2])
→
魔法使い


# 2次元リストの要素の個数を出力する
basket = [["木の棒", "こん棒"], ["おにぎり", "おにぎり", "むぎ茶"], ["アイアンシールド"], ["毒消し","毒消し","毒消し","毒消し"]]
print(len(basket[1]))
→
3


# 2次元リストに要素を追加する
basket = [["木の棒", "こん棒", "エクスカリバー"], ["おにぎり", "おにぎり", "むぎ茶"], ["毒消し", "薬草", "アイアンシールド"]]
# ここに、要素を追加するコードを記述する
basket[0].append('石斧')
print(basket)
→
[['木の棒', 'こん棒', 'エクスカリバー', '石斧'], ['おにぎり', 'おにぎり', 'むぎ茶'], ['毒消し', '薬草', 'アイアンシールド']]


# 2次元リストに要素を削除する
basket = [["木の棒", "こん棒", "エクスカリバー"], ["おにぎり", "おにぎり", "むぎ茶"], ["毒消し", "薬草", "アイアンシールド"]]
# ここに、要素を削除するコードを記述する
del basket[2][2]
print(basket)
→
[['木の棒', 'こん棒', 'エクスカリバー'], ['おにぎり', 'おにぎり', 'むぎ茶'], ['毒消し', '薬草']]



# enumerate()
ループで要素と番号を同時に取り出す
「エニュメレート」は “番号をふる” の意味

for i, item in enumerate(["りんご", "みかん", "ぶどう"]):
    print(i, item)
→
0 りんご
1 みかん
2 ぶどう

for i, item in enumerate(["りんご", "みかん", "ぶどう"], start=1):
    print(i, item)
→
1 りんご
2 みかん
3 ぶどう


# ループでリストを処理する
team = ["勇者", "戦士", "魔法使い"]
print(team)
print(team[0])

for (i, person) in enumerate(team, start = 1):
    print(str(i) + '番目の' + person + 'がスライムと戦った')
→
1番目の勇者がスライムと戦った
2番目の戦士がスライムと戦った
3番目の魔法使いがスライムと戦った


numbers = [3, 1, 4, 1, 5]
results = []
for item in numbers:
    results.append(item * 10)
print(results)
→
[30, 10, 40, 10, 50]


# 2次元リストをforで作成する
numbers = [i * 2 for i in range(10)]
print(numbers)
print(len(numbers))

numbers2 = [[1 for i in range(3)] for j in range(4)]
print(numbers2)
numbers2[0][2] = 2
print(numbers2)
→
[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]
10
[[1, 1, 1], [1, 1, 1], [1, 1, 1], [1, 1, 1]]
[[1, 1, 2], [1, 1, 1], [1, 1, 1], [1, 1, 1]]


# ドット絵を表示する
enemy_img = [[0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0],
             [1,1,0,0,0,0,0,0,0,0,0,0,0,0,1,1],
             [1,0,0,1,1,1,0,0,0,1,1,1,0,0,0,1],
             [1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1],
             [0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0],
             [0,0,0,1,1,1,0,0,0,0,0,1,1,1,0,0],
             [0,0,0,0,1,1,1,0,0,0,0,0,0,1,1,1]]

for line in enemy_img:
    for dot in line:
        if dot == 1:
            print('*', end='')
        else:
            print(' ', end='')
    print()

最後のprint() は、**「1行ぶんを描き終わったあとに改行するため」

→
  ************  
**            **
*  ***   ***   *
**    **      **
 ************** 
   ***     ***  
    ***      ***



# 3次元リストでドット絵を表示する
enemy_img = [[[0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0],
              [1,1,0,0,0,0,0,0,0,0,0,0,0,0,1,1],
              [1,0,0,1,1,1,0,0,0,1,1,1,0,0,0,1],
              [1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1],
              [0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0],
              [0,0,0,1,1,1,0,0,0,0,0,1,1,1,0,0],
              [0,0,0,0,1,1,1,0,0,0,0,0,0,1,1,1]],
             [[0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0],
              [1,1,0,0,0,0,0,0,0,0,0,0,0,0,1,1],
              [1,0,0,1,1,1,0,0,0,0,1,1,1,0,0,1],
              [1,1,0,0,0,0,0,1,1,0,0,0,0,0,1,1],
              [0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0],
              [0,0,0,1,1,1,0,0,0,0,1,1,1,0,0,0],
              [0,0,0,1,1,1,0,0,0,0,1,1,1,0,0,0]],
             [[0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0],
              [1,1,0,0,0,0,0,0,0,0,0,0,0,0,1,1],
              [1,0,0,0,1,1,1,0,0,0,1,1,1,0,0,1],
              [1,1,0,0,0,0,0,0,1,1,0,0,0,0,1,1],
              [0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0],
              [0,0,1,1,1,0,0,0,0,0,0,1,1,1,0,0],
              [1,1,1,0,0,0,0,0,0,0,1,1,1,0,0,0]]]

for img in enemy_img:
    for line in img:
        for dot in line:
            if dot == 1:
                print("#", end = "")
            else:
                print(" ", end = "")
        print()

→
  ############  
##            ##
#  ###   ###   #
##    ##      ##
 ############## 
   ###     ###  
    ###      ###
  ############  
##            ##
#  ###    ###  #
##     ##     ##
 ############## 
   ###    ###   
   ###    ###   
  ############  
##            ##
#   ###   ###  #
##      ##    ##
 ############## 
  ###      ###  
###       ###   


letters = [[[0,0,1,1,0,0],
             [0,1,0,0,1,0],
             [1,0,0,0,0,1],
             [1,1,1,1,1,1],
             [1,0,0,0,0,1],
             [1,0,0,0,0,1]],
            [[1,1,1,1,1,0],
             [1,0,0,0,0,1],
             [1,1,1,1,1,0],
             [1,0,0,0,0,1],
             [1,0,0,0,0,1],
             [1,1,1,1,1,0]],
            [[0,1,1,1,1,0],
             [1,0,0,0,0,1],
             [1,0,0,0,0,0],
             [1,0,0,0,0,0],
             [1,0,0,0,0,1],
             [0,1,1,1,1,0]]]

# ここに、ドットを表示するコードを記述する
for img in letters:
    for line in img:
        for dot in line:
            if dot == 1:
                print("@", end="")
            else:
                print(" ", end="")
        print()
    print()
→
  @@  
 @  @ 
@    @
@@@@@@
@    @
@    @

@@@@@ 
@    @
@@@@@ 
@    @
@    @
@@@@@ 

 @@@@ 
@    @
@     
@     
@    @
 @@@@ 


# 2次元リストで地図を表示する
landmap = [['森' for i in range(20)] for j in range(10)]
landmap[0][0] = '城'
landmap[0][19] = '街'
landmap[9][19] = '街'
for (i, line) in enumerate(landmap):
    print(str(i) + ":", end="")
    for area in line:
        print(area, end="")
    print()
→
0:城森森森森森森森森森森森森森森森森森森街
1:森森森森森森森森森森森森森森森森森森森森
2:森森森森森森森森森森森森森森森森森森森森
3:森森森森森森森森森森森森森森森森森森森森
4:森森森森森森森森森森森森森森森森森森森森
5:森森森森森森森森森森森森森森森森森森森森
6:森森森森森森森森森森森森森森森森森森森森
7:森森森森森森森森森森森森森森森森森森森森
8:森森森森森森森森森森森森森森森森森森森森
9:森森森森森森森森森森森森森森森森森森森街


# 複数行テキストに行番号を追加する
text = ["吾輩は猫である",
        "名前はまだ無い",
        "どこで生まれたか",
        "とんと見当がつかぬ"]
#ここに、行番号を表示するコードを記述する
for (i, line) in enumerate(text, start =1):
    print(str(i) + ":" +line)
→
1:吾輩は猫である
2:名前はまだ無い
3:どこで生まれたか
4:とんと見当がつかぬ


# 2次元リストで地図を表示する
landmap = [["森" for i in range(20)] for j in range(10)]
landmap[0][0] = "城"
landmap[0][19] = "町"
landmap[9][19] = "町"
for i,line in enumerate(landmap):
    print(str(i) + ":", end="")
    for j, area in enumerate(line):
        if (i % 2 == 0 or j % 3 == 0) and area =="森":
            print("＋", end="")
        else:
            print(area, end="")
    print()
→
0:城＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋町
1:＋森森＋森森＋森森＋森森＋森森＋森森＋森
2:＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋
3:＋森森＋森森＋森森＋森森＋森森＋森森＋森
4:＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋
5:＋森森＋森森＋森森＋森森＋森森＋森森＋森
6:＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋
7:＋森森＋森森＋森森＋森森＋森森＋森森＋森
8:＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋
9:＋森森＋森森＋森森＋森森＋森森＋森森＋町



# 標準入力から2次元リスト
enemy_img = []
while True:
    line = input()
    if line == "_":
        break
    enemy_img.append(line.split(","))
# print(enemy_img)


for line in enemy_img:
    for dot in line:
        if int(dot) == 1:　　　　　#標準入力からは文字列になっているので、数値に変換！
            print("#", end="")
        else:
            print(" ", end="")
    print()
(入力)
0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0
1,1,0,0,0,0,0,0,0,0,0,0,0,0,1,1
1,0,0,1,1,1,0,0,0,1,1,1,0,0,0,1
1,1,0,0,0,0,1,1,0,0,0,0,0,0,1,1
0,0,1,1,1,1,1,1,1,1,1,1,1,1,0,0
0,0,0,1,1,1,0,0,0,0,0,1,1,1,0,0
0,0,0,0,1,1,1,0,0,0,0,0,0,1,1,1
_

→
  ############  
##            ##
#  ###   ###   #
##    ##      ##
  ############  
   ###     ###  
    ###      ###
